[
    {
        "name": "Portfolio Version 1",
        "image": "",
        "description": "Portfolio Version 1 is my first personal portfolio website created using React. This single-page application demonstrates my frontend development skills with a responsive layout that works across devices. The project includes sections for showcasing my work, an about me page, and contact information. Built with modern React practices, it features component-based architecture and efficient state management. Deployed via GitHub Pages, this portfolio served as my initial online presence to display my growing skills as a developer.",
        "short_description": "A responsive personal portfolio website built with React, showcasing my projects and skills. Features clean design, easy navigation, and GitHub deployment.",
        "markdown": "json/projects/project/portfolio_version_1.md",
        "tech_stack": "React | JavaScript | HTML5 | CSS3 | GitHub Pages",
        "startDate": "2023-05-30T00:00:00.000Z",
        "source_link": "https://github.com/alcoranpaul/portfolio",
        "live_link": "https://alcoranpaul.github.io/portfolio/",
        "endDate": "2023-07-14T00:00:00.000Z"
    },
    {
        "name": "Level up Tracker",
        "image": "",
        "description": "Level Up Tracker is a gamified productivity application that monitors active PC usage, analyzing time spent on applications to help users optimize efficiency. Built with a Python backend for data tracking and processing and a Unity frontend for an interactive experience, it transforms productivity into a reward-based system—offering insights, goal-setting, and progress visualization. Inspired by task managers, it encourages focused work by identifying distractions and providing actionable feedback, with future plans for achievements, alerts, and advanced analytics.",
        "short_description": "A gamified productivity tracker that monitors PC application usage, analyzes time spent, and helps users optimize efficiency—built with Python (backend) and Unity (frontend).",
        "markdown": "json/projects/project/level_up_tracker.md",
        "tech_stack": "Python (Backend) | Unity Engine (Frontend) | Flask",
        "startDate": "2025-04-10T00:00:00.000Z",
        "source_link": "",
        "live_link": ""
    },
    {
        "name": "Miguel’s Birthday",
        "image": "",
        "description": "In a quiet home in Manila, a cheerful birthday party turns into a surreal nightmare. You play as both Miguel, a sensitive 4-year-old boy, and his hardworking mother preparing for the big day. What starts as innocent fun quickly unravels as Miguel begins to see disturbing visions tied to the hired clown—who may be more than he appears.",
        "short_description": "A surreal narrative horror set during a child’s birthday in Manila, where you play as both a mother and her son—unraveling a chilling mystery around a sinister clown, blurring the line between fear and reality.",
        "markdown": "json/projects/project/miguels_birthday.md",
        "tech_stack": "C# | Flax Engine",
        "startDate": "2025-02-10T00:00:00.000Z",
        "source_link": "",
        "live_link": ""
    },
    {
        "name": "DunGen",
        "image": "",
        "description": "DunGen is a procedural dungeon generator built for Flax Engine, leveraging grid-based placement, A pathfinding**, and Delaunay triangulation (Bowyer-Watson algorithm) to dynamically create interconnected dungeons. Inspired by vazgriz’s procedural generation techniques, it combines Prim’s algorithm for minimal spanning trees with modular asset placement, ensuring logically navigable layouts. The system supports custom rules for room spawning, corridor generation, and debugging (using ToadNet’s assets), offering a flexible foundation for game developers. Designed for extensibility, it integrates third-party tools while maintaining clean C# architecture.",
        "short_description": "A procedural dungeon generator for Flax Engine (C#) using grid systems, A pathfinding, and Delaunay triangulation to create modular, navigable layouts.",
        "markdown": "json/projects/project/dungeon_generator.md",
        "tech_stack": "Flax Engine | C# | Procedural Generation | A* Pathfinding | Delaunay Triangulation | Prim’s Algorithm",
        "startDate": "2024-10-15T00:00:00.000Z",
        "source_link": "https://github.com/alcoranpaul/DunGen",
        "live_link": "",
        "endDate": "2024-11-01T00:00:00.000Z"
    },
    {
        "name": "Grid system",
        "image": "",
        "description": "Grid System is a versatile C# library designed for game development, providing essential tools for tile-based worlds, including grid management, A pathfinding, and coordinate transformations (world-to-grid and vice versa). Built for modularity, it supports customizable cell sizes, obstacle tagging, and dynamic grid resizing, making it ideal for strategy games, roguelikes, or procedural generation projects. The clean API and documented code (available on GitHub) allow seamless integration with engines like Unity or Flax, while performance optimizations ensure efficiency for large-scale maps.",
        "short_description": "A flexible grid system library for game development in C#, featuring pathfinding, coordinate conversions, and tile-based operations.",
        "markdown": "json/projects/project/grid_system.md",
        "tech_stack": "C# | Flax Engine | Grid-Based Systems | A* Pathfinding | Tile Management",
        "startDate": "2024-10-30T00:00:00.000Z",
        "source_link": "https://github.com/alcoranpaul/GridSystem",
        "live_link": "",
        "endDate": "2024-12-02T00:00:00.000Z"
    },
    {
        "name": "Face-Recog",
        "image": "",
        "description": "Face-Recog is a full-stack facial recognition application that leverages the Clarifai API to detect faces in images. The frontend is built with React and Tachyons CSS for a responsive interface, while the backend uses Node.js with Express.js and PostgreSQL for secure user authentication and data storage. The system features clean, modular code architecture and demonstrates seamless integration of external APIs with custom user management.",
        "short_description": "Face recognition web app built with React and Node.js, featuring Clarifai API integration, user authentication, and PostgreSQL database.",
        "markdown": "json/projects/project/face_recog.md",
        "tech_stack": "React | Node.js | Express.js | PostgreSQL | Clarifai API | Tachyons CSS | Authentication",
        "startDate": "2023-04-24T00:00:00.000Z",
        "source_link": "https://github.com/alcoranpaul/face-recog",
        "live_link": "https://facerecog-pu3u.onrender.com",
        "endDate": "2023-05-30T00:00:00.000Z"
    },
    {
        "name": "Crwn-clothing",
        "image": "",
        "description": "Crwn-clothing is a modern e-commerce platform for fashion retail, built with React, Redux, and Firebase. The app features user authentication, a shopping cart system, and integrated Stripe API for secure payments. With styled-components for UI design and Redux for state management, it offers a seamless shopping experience. The project demonstrates full-stack capabilities with Firebase handling backend services (database, auth, and cloud functions) while deployed live on Netlify as a production-ready PWA (Progressive Web App).",
        "short_description": "A full-stack e-commerce clothing store built with React, featuring Stripe payments, Firebase authentication, and Redux state management.",
        "markdown": "json/projects/project/crwn_clothing.md",
        "tech_stack": "React | Redux | Firebase | Stripe API | styled-components | Progressive Web App (PWA) | Netlify",
        "startDate": "2023-05-02T00:00:00.000Z",
        "source_link": "https://github.com/alcoranpaul/crwn-clothing",
        "live_link": "https://crwn-clothingapp.netlify.app",
        "endDate": "2023-05-29T00:00:00.000Z"
    },
    {
        "name": "Toxic Bloom",
        "image": "assets/projects/toxic_bloom_banner.png",
        "description": "You take on the role of a botanist stranded on a mysterious, alien planet where the flora is both beautiful and deadly. The planet's ecosystem is powered by a toxic substance that causes plants to grow rapidly but also mutate into dangerous forms. The player must navigate this hazardous environment, using the poison to their advantage while avoiding its deadly effects.",
        "short_description": "An atmospheric first-person exploration game built with Flax Engine, featuring a surreal biomechanical world filled with environmental storytelling.",
        "markdown": "json/projects/project/toxic_bloom.md",
        "tech_stack": "3D | Flax Engine | Open World | Plants | Poison | Walking simulator",
        "startDate": "2025-02-01T00:00:00.000Z",
        "source_link": "",
        "live_link": "https://digitalino.itch.io/toxic-bloom",
        "endDate": "2025-02-07T00:00:00.000Z"
    },
    {
        "name": "Bloody buds",
        "image": "assets/projects/bloody_buds_banner.png",
        "description": "A fast paced hack and slash game where you take on the role of Rosete, wielding her powerful rose sword. With every swing of this double edged blade, you risk losing a heart, but each successful strike against your foes replenishes two hearts. ",
        "short_description": "A satirical top-down shooter where mutant office plants battle corporate drones, built with Unity (C#) featuring rogue-like upgrades and procedural office arenas.",
        "markdown": "json/projects/project/bloody_buds.md",
        "tech_stack": "2D | Unity Engine | | Hack and Slash | Simple",
        "startDate": "2024-04-21T00:00:00.000Z",
        "source_link": "",
        "live_link": "https://tojak.itch.io/bloody-buds",
        "endDate": "2024-04-25T00:00:00.000Z"
    },
    {
        "name": "Elemental Conquest",
        "image": "assets/projects/elemental_conquest_banner.png",
        "description": "A fast-paced elemental combat game where players master four distinct magic types to defeat waves of enemies. Built with Unity, featuring dynamic spell combinations and environmental interactions that change battlefield conditions.",
        "short_description": "Unity-based elemental action game with spell-combining mechanics",
        "markdown": "json/projects/project/elemental_conquest.md",
        "tech_stack": "Unity | C# | VFX Graph | Shader Graph",
        "startDate": "2024-01-05T00:00:00.000Z",
        "source_link": "",
        "live_link": "https://ihoist.itch.io/elemental-conquest",
        "endDate": "2024-02-05T00:00:00.000Z"
    },
    {
        "name": "Illuminagent",
        "image": "assets/projects/illuminagent_banner.png",
        "description": "A tactical stealth game where players control a light-manipulating agent infiltrating shadowy facilities. Developed in Unity with custom light propagation systems and AI that reacts dynamically to both light and sound.",
        "short_description": "Unity stealth game with advanced light simulation",
        "markdown": "json/projects/project/illuminagent.md",
        "tech_stack": "Unity | C# | Light Baking | AI NavMesh",
        "startDate": "2024-01-29T00:00:00.000Z",
        "source_link": "",
        "live_link": "https://digitalino.itch.io/illuminagent",
        "endDate": "2024-02-02T00:00:00.000Z"
    },
    {
        "name": "Builder Defender",
        "image": "assets/projects/builder_defender_banner.png",
        "description": "A unique tower defense hybrid where players simultaneously build and defend their structures in real-time. Unity-powered with procedural map generation and destructible terrain physics.",
        "short_description": "Unity tower defense with real-time building mechanics",
        "markdown": "json/projects/project/builder_defender.md",
        "tech_stack": "Unity | C# | Procedural Generation",
        "startDate": "2023-07-31T00:00:00.000Z",
        "source_link": "",
        "live_link": "https://digitalino.itch.io/builder-defender",
        "endDate": "2022-08-08T00:00:00.000Z"
    },
    {
        "name": "Feathered Fiasco",
        "image": "assets/projects/feathered_fiasco_banner.jpg",
        "description": "In this Swanderful Tale, Featherbrook, and the source of their food, faces a dire threat as Queeny, a mystic swan, devours all the produce in the town's food garden, growing more powerful with each bite. Armed with your trusty shotgun, you must battle Queeny to save Featherbrook from starvation. It's a showdown of proving who really is the final boss, in a fight that puts Gluttony against Survival.",
        "short_description": "Unreal Engine physics-based bird simulator",
        "markdown": "json/projects/project/feathered_fiasco.md",
        "tech_stack": "Unreal Engine | Blueprints | Physics Simulation",
        "startDate": "2024-01-02T00:00:00.000Z",
        "source_link": "",
        "live_link": "https://calveingames.itch.io/feathered-fiasco",
        "endDate": "2024-01-08T00:00:00.000Z"
    },
    {
        "name": "Conscious Relay",
        "image": "assets/projects/conscious_relay_banner.png",
        "description": "A mind-bending puzzle-platformer built in Unity where players swap consciousness between characters to solve challenges. Features time-manipulation mechanics and co-op gameplay elements.",
        "short_description": "Unity puzzle game with consciousness-swapping mechanics",
        "markdown": "json/projects/project/conscious_relay.md",
        "tech_stack": "Unity | C# | Timeline | Cinemachine",
        "startDate": "2024-01-07T00:00:00.000Z",
        "source_link": "",
        "live_link": "https://digitalino.itch.io/conscious-relay",
        "endDate": "2024-01-14T00:00:00.000Z"
    },
    {
        "name": "Khai Creates E-Commerce",
        "image": "assets/projects/khai_creates_banner.jpg",
        "description": "Khai-Creates is a fully customized e-commerce platform designed specifically for a crochet business to enhance product visibility and streamline online orders. Built with React and TypeScript, the website delivers a responsive and user-friendly interface optimized for both desktop and mobile devices. It integrates Google Sheets as a lightweight CMS, empowering the client to manage inventory without technical expertise. Product images are dynamically loaded from Google Drive, reducing hosting costs and simplifying content updates. Serverless functions deployed on Netlify securely handle product data and order processing, providing scalable backend services without infrastructure overhead. Additional features include custom product filtering, category sorting, search functionality, a bespoke ordering system, and real-time customer support via embedded live chat. The project emphasizes performance optimization and SEO best practices to ensure fast loading times and improved search engine visibility. Client collaboration and training were integral parts of the development process, enabling independent content management post-launch.",
        "short_description": "Khai-Creates is a custom e-commerce website tailored for a crochet business, featuring a responsive React and TypeScript frontend, seamless Google Sheets-powered inventory management, dynamic Google Drive image integration, and scalable Netlify serverless backend functions.",
        "markdown": "json/projects/project/khai_creates.md",
        "tech_stack": "React || TypeScript || Vite || Netlify || Google Drive/Sheets API || Serverless Functions",
        "startDate": "2025-04-17T00:00:00.000Z",
        "source_link": "",
        "live_link": "https://khaicreates.netlify.app",
        "endDate": "2025-05-14T00:00:00.000Z"
    },
    {
        "name": "Text To Brainrot",
        "image": "",
        "description": "A satirical text transformation tool that converts normal text into exaggerated 'brainrot' internet slang, built with Python. The program systematically replaces standard vocabulary with terminally online phrases, meme references, and absurdist humor patterns, demonstrating NLP techniques through playful linguistic degradation.",
        "short_description": "Python text converter that mutates normal writing into absurd internet slang",
        "markdown": "json/projects/project/text_to_brainrot.md",
        "tech_stack": "Python | Microsoft TTS | OpenAI Whisper | DeepSeek API | FFmpeg",
        "startDate": "2025-05-08T00:00:00.000Z",
        "source_link": "https://github.com/alcoranpaul/text_to_brainrot",
        "live_link": "",
        "endDate": "2025-05-14T00:00:00.000Z"
    },
    {
        "name": "Bible Chronicles",
        "image": "",
        "description": "A C# console application that gamifies Bible reading through interactive challenges, achievement tracking, and progress systems. The app transforms scripture study into an engaging experience with daily reading goals, quiz elements, and unlockable content, all implemented with clean object-oriented architecture.",
        "short_description": "C# console game that makes Bible reading interactive through gamification",
        "markdown": "json/projects/project/bible_chronicles.md",
        "tech_stack": "C# | .NET | Console Application | OOP | Python",
        "startDate": "2025-04-23T00:00:00.000Z",
        "source_link": "",
        "live_link": "",
        "endDate": "2025-05-07T00:00:00.000Z"
    }
]
