[
    {
      "title": "Gameplay Programmer",
      "company": null,
      "years": "2022 - Present",
      "description": [
        "Developed core **gameplay systems**, including **interaction mechanics**, **locker-hiding stealth logic**, **dynamic quest/task tracking**, and a **modular inventory and crafting system**, contributing to an immersive player experience.",
        "Engineered a **modular Souls-like combat system**, incorporating **stamina management**, **hit detection**, **animation canceling**, and **parrying mechanics** to create a responsive, skill-based combat experience.",
        "Designed and developed **AI logic** for a **100-NPC battle royale**, utilizing Unity's built-in **NavMesh**, state machines, and performance optimizations to enable large-scale, real-time simulation with smooth gameplay performance.",
        "Created **horror AI** with unpredictable **patrol patterns**, **line-of-sight triggers**, and **audio cues**, resulting in a dynamic, tension-filled experience that generates unexpected scare events.",
        "Built core systems, including **inventory management** and a **procedural dungeon generator**, demonstrating versatility and experience across both 2D and 3D projects.",
        "Led development of complex **game mechanics** that enhanced gameplay, such as **puzzle systems**, **dynamic NPC behaviors**, and **in-game economy systems**, adding layers of depth to the player experience.",
        "Integrated and fine-tuned **animation systems**, ensuring smooth character movements and seamless transitions during combat, exploration, and interaction.",
        "Collaborated in **remote, time-restricted game jams** using tools like **Discord**, **Trello**, **GitHub**, and **Plastic SCM**, coordinating asset integration and managing workflows between programmers and artists, ensuring project milestones were met efficiently.",
        "Worked with cross-functional teams to troubleshoot and resolve issues related to **game performance**, **bug fixes**, and **mechanic balancing** to ensure high-quality final deliverables.",
        "Actively participated in design discussions to implement **player feedback** and enhance overall gameplay balance and challenge."
      ]
    },
    {
      "title": "Web Development Training & Self-Learning",
      "company": null,
      "years": "2020 – 2024",
      "description": [
        "**Self-taught full-stack web development** through a variety of online resources, including courses, tutorials, and hands-on projects. Focused on core web technologies such as **React**, **JavaScript**, **TypeScript**, **Node.js**, and **Firebase**, mastering both front-end and back-end development principles.",
        "Gained in-depth knowledge of **UI/UX design**, prioritizing responsive and intuitive user interfaces, accessibility, and performance optimization to improve the overall user experience.",
        "**Developed proficiency in back-end technologies**, learning **Node.js** for server-side logic and integrating with databases like **MongoDB** and **SQLite** for dynamic, data-driven applications.",
        "Gained hands-on experience with **serverless architectures** and **API integration**, enabling the development of scalable, low-maintenance applications with **Netlify** hosting, and optimizing workflows using **Git/GitHub** for version control and collaboration.",
        "Engaged in a range of **personal projects** to apply theoretical knowledge in real-world scenarios, including e-commerce websites, interactive web applications, and custom-built CRUD (Create, Read, Update, Delete) systems.",
        "Constantly challenged myself by participating in coding challenges and contributing to open-source communities, which enhanced problem-solving skills and kept me up-to-date with industry trends and best practices."
      ]
    },
    {
      "title": "Freelance Web Developer",
      "company": null,
      "years": "2025 – Present",
      "description": [
        "**Freelanced** as a web developer, designing and delivering **custom web applications** tailored to clients' needs with a strong focus on **React**, **TypeScript**, and **Node.js** to create dynamic, responsive, and user-friendly interfaces.",
        "Developed a **custom e-commerce application** using **React** and **TypeScript**, ensuring a seamless and intuitive product browsing experience that significantly enhanced user engagement and sales conversion.",
        "**Implemented backend solutions** using **Node.js** to provide robust data handling, user authentication, and server-side logic, building scalable applications that efficiently managed user interactions and business processes.",
        "Integrated **Firebase** for backend services such as **real-time database**, **authentication**, and **cloud functions**, boosting scalability and simplifying user management.",
        "Hosted and deployed web applications using **OnRender**, providing reliable, auto-scaling hosting environments that ensured seamless transitions from development to production, with minimal downtime.",
        "Utilized **Google Sheets API** and **Google Drive API** to streamline data management, enabling real-time inventory updates and efficient backend operations for clients with minimal infrastructure.",
        "Designed and developed **custom CRUD operations**, enabling smooth data manipulation and creating intuitive dashboards for clients to manage products, orders, and customers.",
        "Ensured **SEO optimization** by adhering to best practices such as semantic HTML, metadata integration, and performance tuning, leading to improved organic search rankings and increased visibility.",
        "Developed custom **product filtering**, **sorting**, and **search functionalities** to improve product discoverability, resulting in an enhanced customer experience and higher retention rates.",
        "Integrated **payment gateways** like **Stripe** and **PayPal**, ensuring secure and seamless transactions for customers, while also handling transaction management and reconciliation on the back-end.",
        "**Collaborated with clients** to understand their business requirements and tailor solutions that addressed specific operational challenges, enhancing client satisfaction and driving business success.",
        "**Optimized site performance** by implementing techniques such as **code splitting**, **lazy loading**, and front-end optimizations, resulting in faster load times and improved overall user experience.",
        "Monitored user engagement through **Google Analytics**, providing insights and recommendations that improved conversion rates and user retention based on real-time data.",
        "Used **GitHub** for version control and collaboration, ensuring streamlined code management and transparent development workflows throughout the project lifecycle.",
        "Provided comprehensive **post-launch support**, including **bug fixes**, **feature updates**, and **client training**, to ensure long-term project success and ongoing client satisfaction."
      ]
    },
    {
      "title": "Front Store Crew",
      "company": "Jollibee Northgate",
      "years": "July 2022 – September 2022",
      "description": [
        "Maintained high standards of **customer service** during high-volume and fast-paced operations, ensuring customer satisfaction through efficient and friendly service.",
        "Upheld the **gold standard** of the store, including adherence to food safety management protocols and company policies on a daily basis.",
        "Operated **POS (Point of Sale)** system to process customer orders, handle cash, and perform accurate transactions in a high-speed environment.",
        "Efficiently handled **order preparation** and packaging, ensuring the timely delivery of food while maintaining quality standards.",
        "**Guided new crew members** by sharing insights on customer service, food handling, and store procedures, leveraging seniority to support team development and ensure smooth store operations.",
        "Managed **cleanliness and organization** of the front store area, including restocking, ensuring the dining area was tidy, and monitoring inventory levels.",
        "Effectively managed customer complaints, demonstrating strong problem-solving skills to resolve issues and ensure a positive customer experience.",
        "Assisted with **promotions and upselling** techniques to encourage customers to purchase additional items, contributing to store sales growth.",
        "Collaborated with team members and managers to maintain a smooth workflow, ensuring efficiency during peak hours and minimizing customer wait times.",
        "Monitored **health and safety** regulations, ensuring that the store remained compliant with local food safety standards and hygiene requirements."
      ]
    },
    {
      "title": "Co-Op Software Developer",
      "company": "Agriculture and Agri-Food Canada",
      "years": "September 2021 – December 2021",
      "description": [
        "Developed a **web application** using **JavaScript** and **Vue** for data input and transfer to a database through **Grails**, improving data collection processes.",
        "Created a **Bridge app** in **MS Access** using **VBA**, automating the transfer of data between Excel files, saving time and reducing manual errors.",
        "Managed **production control** processes, including transferring files with agriculture-related data across departments using **MS Word**, **Excel**, and **Access**.",
        "Designed and implemented user interface improvements, including **progress bars** for the **Bridge app**, enhancing user feedback during data transfers.",
        "Followed project schedules and coordinated with multiple departments to ensure the timely delivery of file transfers and updates.",
        "Applied **software engineering principles** to modularize code, improving maintainability and efficiency in both web and desktop applications.",
        "Conducted extensive testing of functions and subroutines, troubleshooting complex issues to optimize performance and functionality.",
        "Collaborated with team members to troubleshoot and improve application features, receiving regular feedback to ensure alignment with project goals.",
        "Documented daily and weekly progress reports for supervisors, ensuring clear communication on task completion and upcoming challenges."
      ]
    },
    {
      "title": "Audio Visual Support",
      "company": "Zion Apostolic Church",
      "years": "August 2018 – August 2024",
      "description": [
        "Set up, operated, and tore down **audio/visual equipment** for weekly worship services and preaching, ensuring seamless technical support for church events and programs.",
        "Designed and created **preaching presentations** using **MS PowerPoint**, incorporating **digital media** and **visual aids** provided by pastors to enhance sermon delivery and engagement.",
        "Coordinated with pastors and worship leaders to integrate **video clips**, **music**, and **graphic elements** into presentations, ensuring a smooth, impactful experience for the congregation.",
        "Managed sound levels, lighting, and projections during live services, ensuring clarity and consistency for both in-person attendees and online streaming audiences.",
        "Troubleshot and resolved technical issues with **audio equipment**, **projectors**, and **streaming software** in real-time, minimizing disruptions and ensuring continuous service.",
        "Trained and mentored new volunteers in **audio/visual equipment setup** and **presentation software**, fostering teamwork and ensuring consistency in service quality.",
        "Regularly maintained and tested all **audio/visual equipment**, including sound systems, projectors, and streaming tools, to ensure reliability and avoid technical disruptions.",
        "Worked collaboratively with the church's media team to develop creative ways to improve **visual storytelling** and enhance the overall worship experience."
      ]
    },
    {
      "title": "Camp Counsellor",
      "company": "Intervarsity Circle Square Ranch",
      "years": "July 2017 & July 2018",
      "description": [
        "Supervised and mentored groups of **school-aged children** in various outdoor and recreational activities, ensuring their safety, well-being, and engagement throughout the camp experience.",
        "Developed and led **age-appropriate activities**, including sports, arts and crafts, and team-building exercises, fostering positive social interactions and personal growth among campers.",
        "Promoted a **healthy and inclusive environment**, encouraging teamwork, cooperation, and respect among campers and staff while addressing any conflicts or behavioral issues in a constructive manner.",
        "Ensured a **safe environment** by maintaining proper safety protocols, conducting regular headcounts, and providing first aid when necessary, prioritizing camper health at all times.",
        "Provided emotional support and mentorship to campers, helping them navigate challenges and build confidence in a supportive and nurturing environment.",
        "Communicated with parents and guardians about camper progress, addressing any concerns and providing feedback to ensure a successful camp experience.",
        "Worked collaboratively with other staff members to ensure smooth operation of daily camp activities, maintaining clear communication and a positive, professional attitude.",
        "Contributed to the **planning and organization** of camp events, ensuring that activities were well-coordinated, engaging, and suited to the interests and abilities of the children.",
        "Fostered a fun and **positive camp culture**, creating lasting memories for campers while encouraging personal growth, friendship, and a love for the outdoors."
      ]
    }

]